Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisViewShadingSurfacesMode Property

---

"Show Shading Surfaces"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisViewShadingSurfacesMode { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisViewShadingSurfacesMode As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewShadingSurfacesMode {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisViewShadingSurfacesMode : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace